docs/blog/joy-of-racket.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-17 Thu 20:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Joy of Learning Racket</title>
<meta name="author" content="Philip Dumaresq" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="assets/org.css" />
<link rel="stylesheet" type="text/css" href="../assets/org.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Joy of Learning Racket</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org86eec7e">The Joy of Learning Racket</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
<a href="../index.html">Home</a> | <a href="../about.html">About</a> | <a href="../contact.html">Contact</a>
</p>
</div>

<div id="outline-container-org86eec7e" class="outline-2">
<h2 id="org86eec7e">The Joy of Learning Racket</h2>
<div class="outline-text-2" id="text-org86eec7e">
<p>
I recently took up learning Racket, and I&rsquo;ve really been loving it. This is just a short mind 
dump/rant of what I&rsquo;ve been loving about Racket so far.
</p>

<p>
First of all, it&rsquo;s a lisp, as a language nerd, I love me some Lisp, so there&rsquo;s some points to it 
right there. Second of all, it&rsquo;s from the sweet spot of language era where it&rsquo;s old enough to have 
an established ecosystem and practices and great tools and it&rsquo;s recognized, but also young enough 
that it feels modern. I think my biggest problem with Common Lisp is that even though it&rsquo;s great, 
some things in it just feel old. The reader macro system, while phenomenal and incredibly powerful, 
makes for messy code. The language has a small standard library, but still feels bloated. There&rsquo;s 
so many different ways of doing things and a lot of code ends up just feeling very verbose.
</p>

<p>
Enter Racket. It&rsquo;s a derivative of Scheme, not Common Lisp, which has traditionally had it&rsquo;s 
emphasis on a minimalist language. Minimalism is great, Scheme doesn&rsquo;t feel bloated the way Common 
Lisp does, code is pretty clean, the reader macro system while equally as powerful feels less 
intrusive, and these make it feel a lot nicer to me. Racket is a derivative of Scheme, but it takes 
the minimalism and throws it out the door purely in terms of the standard library. The syntax is 
Scheme, so your core language isn&rsquo;t bloated with reader macro symbols all over the place like 
Common Lisp and the code is a lot less verbose, but it&rsquo;s powerful. The standard library contains 
libraries for building full GUIs, webservers, multithreading, cli applications, etc., it&rsquo;s great. 
Because it&rsquo;s a Lisp, it&rsquo;s also dynamically typed. However, Racket even includes a library for 
adding static typing to the language, so you get the best of both worlds. The reason Racket has so 
much in it&rsquo;s standard library is because it was built as a language for teaching. University of 
Waterloo teaches Racket as a first language for example. But since it was built with teaching in 
mind, it&rsquo;s got to be able to do all the things that you would normally teach someone to do in a 
language, which happens to cover a lot of use cases. Racket also defines itself as being a 
&ldquo;language oriented programming&rdquo;  language, which is a weird way of saying that one of the primary 
goals of the language is to facilitate making languages. So it&rsquo;s great for creating all sorts of 
DSLs that are built on top of Racket instead of the normal process of creating a YAML parser for 50 
different languages.
</p>

<p>
Again, being a teaching language, it itself has phenomenal documentation, but not just docs, it 
also has guides. And it has guides for every level of programmer. Never touched programming before? 
It&rsquo;s got official guides and textbooks for getting started. Programmed but never used Lisp? They&rsquo;ve 
got you covered. Advanced programmer and dabbled in Lisp? Used Lisp but not convinced you should 
use it in a production system? Want to use it in a production system but don&rsquo;t know where to get 
started? They have it all, so many guides. And the guides are built in a wonderful way, they have a 
system that automatically links you to the docs for the name of every function, which I know is 
nothing new or revolutionary, but it&rsquo;s still highly appreciated to have. It makes it super easy to 
follow the guides. And when you do click on those links to check a reference, the whole language is 
really well documented, it&rsquo;s super easy to understand what everything does. The docs for the 
<code>parameterize</code> function for example have 5 different examples - although that is higher than most to 
be fair.
</p>

<p>
Racket also ships with a text editor called DrRacket, which is a fantastic editor for testing the 
waters without needing to delve into Emacs, because Emacs is hard, but also the only full fledged 
environment for doing most serious Lisp programming. DrRacket has you covered through for Racket 
stuff. When you hover over a function, it&rsquo;ll show you where exactly that function comes from, you 
can peek definitions super easily, etc., and again, this is nothing revolutionary, but it&rsquo;s great 
for learning the language and seeing what package is used where and stuff. It&rsquo;s got a terminal 
that&rsquo;s able to draw in non-ascii, which is great because some of the guides allow you to just learn 
by doing fun stuff by drawing simple shapes and seeing how you can expand just drawing simple 
shapes to repeating them, making matrices out of them and expanding them into building a checkers 
board for example. It&rsquo;s nothing revolutionary, but it&rsquo;s done well, and it makes you enjoy what 
you&rsquo;re doing.
</p>

<p>
Finally, Racket makes things really easy. When I&rsquo;m writing code, it feels like the Python of Lisp 
languages (although with better benchmarks than Python). It&rsquo;s super easy to use, read and learn. 
It&rsquo;s really powerful and it&rsquo;s fun to use. One of the guides that I read through was for building a 
multi-threaded webserver from scratch using just their TCP-socket stuff from their standard
library. My whole webserver was only 30 lines of code, and while all it can do right now is send 
back &ldquo;Hello world&rdquo;, I already knew after just an hour of using the language how I could make it into
a much more full-featured web server. Except I don&rsquo;t have to do that, because Racket already has a 
full-featured web server that ships with it.
</p>

<p>
Racket has been a joy to learn, and I&rsquo;d love to continuing to use it for my own projects. For 
anyone looking for learn a new language in their spare time, I would 10/10 recommend giving Racket 
a shot.
</p>

<p>
If you want to get started with Racket, just take a look at the guides on the offical Racket 
website, they&rsquo;re all phenomenal: <a href="https://docs.racket-lang.org/guide/index.htm">https://docs.racket-lang.org/guide/index.htm</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Philip Dumaresq</p>
<p class="date">Created: 2022-02-17 Thu 20:07</p>
</div>
</body>
</html>
